In [55]:
import pandas as pd
import numpy as np

In [27]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})

df

df.groupby(['key1', 'key2']).size()  # ile jest kluczy danego rodzaju; a Series containing group sizes
df.groupby(['key1', 'key2']).count()  # ile jest wartosci w kolumnach dla danych kluczy

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [28]:
people = pd.DataFrame(np.random.randn(5, 5), 
                      columns=['a', 'b', 'c', 'd', 'e'], 
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

people.iloc[2, [1, 2]] = np.nan # Add a few NA values
people

# Grouping with Functions
people.groupby(len)
people.groupby(len).sum() # Any function passed as a group key will be called once per index value, with the return values being used as the group names.


key_list = ['one', 'one', 'one', 'two', 'two']  # 3 literowe imie ma key2: one, two
grupowanie = people.groupby([len, key_list]).min() # [key1, key2]; hierarchical index powstal ;)
grupowanie

              a         b         c         d         e
3 one  0.165694  0.102619  0.403673 -1.293274  1.157171
  two -0.169765 -0.312602  0.576909  0.136041 -0.363545
5 one  0.483131 -0.480968  0.409682  1.222972 -0.822164
6 two  1.272888 -0.777318  0.505787  0.180448 -2.474433

In [29]:
people.loc['Joe']

a    0.165694
b    0.102619
c    0.403673
d   -1.293274
e    1.199770
Name: Joe, dtype: float64

In [30]:
grupowanie.loc[3]  # integer nie string, bo len() to int, ale widac da sie tak grupowac tez ;)

            a         b         c         d         e
one  0.165694  0.102619  0.403673 -1.293274  1.157171
two -0.169765 -0.312602  0.576909  0.136041 -0.363545

In [31]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], [1, 3, 5, 1, 3]], 
                                    names=['cty', 'tenor']) # sposob na przechowywanie multiindeksu pod zmienna

hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.275888  0.128100  0.473040 -0.324214  1.461416
1      0.040680  1.204297 -0.118819  0.220712 -0.000620
2      0.078966  0.123557  0.740980  0.220804 -0.408383
3      0.075853  0.563983 -1.322446  0.606349  0.852447

In [32]:
hier_df.groupby(level='cty', axis=1).count() # to group by level use 'level' keyword

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [33]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 4, 'value': np.arange(12.)})
df

   key  value
0    a    0.0
1    b    1.0
2    c    2.0
3    a    3.0
4    b    4.0
5    c    5.0
6    a    6.0
7    b    7.0
8    c    8.0
9    a    9.0
10   b   10.0
11   c   11.0

In [34]:
g = df.groupby('key')
g.mean()

     value
key
a      4.5
b      5.5
c      6.5

In [35]:
g = df.groupby('key').value
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [39]:
# 

#pd.value_counts('kolumna')[:10] # ilosc takich samych wpisow w kolumnie 
#nutrients.duplicated().sum() # number of duplicates

In [53]:
np.array([1, 2, 3])

TypeError: 'tuple' object is not callable